@echo off
chcp 65001 > nul

set SCRIPT_DIR=%~dp0
cd /d "%SCRIPT_DIR%"

echo ===================================================
echo ЗАПУСК СКРИПТА УСТАНОВКИ ЗАВИСИМОСТЕЙ В ГЛОБАЛЬНУЮ СРЕДУ
echo ===================================================
echo.

echo ===================================================
echo Нажмите для продолжения...
echo ===================================================
echo.

pip install -r requirements.txt

echo.
echo ===================================================
echo ✅ Установка зависимостей завершена
echo ===================================================
pause
